app/views/posts/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 5], ["post_id", 11], ["LIMIT", 1]]
---
                <% if @current_user%>
                  <% if !(Like.find_by(user_id: @current_user.id, post_id: params[:id]))%>

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 6], ["post_id", 17], ["LIMIT", 1]]
---
                    <div class="unlike">
                      <% if Like.find_by(user_id: @current_user.id, post_id: params[:id])%>