app/controllers/application_controller.rb

    def ensure_correct_user #post user_idの対応をとる
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]