app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)
    @replies = Reply.where(post_id: @post.id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 11]]

  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user[:id],
      year: params[:year],
      no: params[:no]
    )
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id", "year", "no") VALUES (?, ?, ?, ?, ?, ?)  [["content", "this is a discovery!!!\r\n"], ["created_at", "2020-05-12 04:11:54.082393"], ["updated_at", "2020-05-12 04:11:54.082393"], ["user_id", 5], ["year", 2005], ["no", 5287]]

  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]

  def search
    @posts = Post.where(year: params[:year], no: params[:no])
---
SELECT "posts".* FROM "posts" WHERE "posts"."year" = ? AND "posts"."no" = ?  [["year", 2005], ["no", 5287]]