app/controllers/replies_controller.rb

INSERT INTO "replies" ("content", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "this is cool"], ["post_id", 0], ["created_at", "2020-05-12 03:59:02.107502"], ["updated_at", "2020-05-12 03:59:02.107502"], ["user_id", 5]]
---
  def create
    @reply = Reply.new(
      content: params[:content],
      user_id: @current_user[:id],
      post_id: params[:post_id]
    )
    if @reply.save