app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all.order(created_at: :desc)

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "bio", "password") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password],
      bio: params[:bio],
    )
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "5.jpg"], ["updated_at", "2020-05-14 05:12:16.039461"], ["id", 5]]
---
  def update
    @user = User.find_by(id: params[:id])
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "user.com"], ["password", "user"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(
      email: params[:email],
      password: params[:password],
    )