app/models/post.rb

    def count
        @post = Post.find_by(id: self.id)
        @count = Like.where(post_id: @post.id)
        return @count.all.count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 10]]